case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    door
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          147;
        startFace       398234;
    }
    fan
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1601;
        startFace       398381;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       399982;
    }
    room
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13511;
        startFace       400072;
    }
    desk
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3408;
        startFace       413583;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        List<word> 1(cyclicAMI);
        nFaces          6984;
        startFace       416991;
        matchTolerance  0.0001;
        neighbourPatch  AMI2;
        transformType   none;
        method          faceAreaWeightAMI;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        List<word> 1(cyclicAMI);
        nFaces          7096;
        startFace       423975;
        matchTolerance  0.0001;
        neighbourPatch  AMI1;
        transformType   none;
        method          faceAreaWeightAMI;
    }
)

// ************************************************************************* //
